# encoding=utf-8
#企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，
# 低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；20万到40万之间时，
# 高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，
# 高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
# 程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。
#1、先判断输入的利润是在哪个区间范围
#2、按照区间范围再进行区别是否能按照对应提成分发奖金

while True:
    try:
        rain = long(raw_input(u'请输入净利润，按回车键结束：'))
        if rain <= 100000:
            diar = rain * 0.1

        elif rain > 100000 and rain < 200000:
            diar = (rain - 100000) * 0.075 + 100000 * 0.1

        elif  rain >= 200000 and rain < 400000:
            diar = (rain -200000) * 0.05 + 200000 * 0.075

        elif rain >= 400000 and rain < 600000:
            diar = (rain - 400000) * 0.03 + 400000 * 0.05

        elif rain >= 600000 and rain < 1000000:
            diar = (rain - 600000) * 0.015 + 600000 * 0.03

        else:
            diar = (rain -1000000) * 0.01 + 1000000 * 0.015

        print u'应该发放的奖金是：',diar
    except ValueError:
        print u'输入有误，请重新输入！'
#比较好的算法如下：
#
# i = long(raw_input(u'输入净利润：'))
# arr = [1000000,600000,400000,200000,100000,0]
# rat = [0.01,0.015,0.03,0.05,0.075,0.1]
# r = 0
# for idx in range(0,6):
#     if i > arr[idx]:
#         r += (i-arr[idx])*rat[idx]
#         print (i-arr[idx])*rat[idx]
#         i = arr[idx]
# print r
